Revit 2026 API

# RibbonItemName Property

---

The name of the item.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; }
```
```vb
Public ReadOnly Property Name As String
	Get
```
```cpp
public:
property String^ Name {
	String^ get ();
}
```
```fsharp
member Name : string with get
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when setting the text to empty or to the string contains "%". |

#### Reference

RibbonItem Class

Autodesk.Revit.UI Namespace